In [3]:
import pandas as pd
import numpy as np
import sqlite3 as sq

In [8]:
query = '''Create Table Test(a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER)'''

In [10]:
con = sq.connect('mydata.sqlite')

In [11]:
con

In [12]:
con.execute(query)

In [13]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]

In [14]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [15]:
con.executemany(stmt, data)

In [16]:
con.commit()

In [17]:
cursor = con.execute('select * from test')

In [18]:
rows = cursor.fetchall()

In [19]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [20]:
data = pd.DataFrame(rows)

In [21]:
data

             0           1     2  3
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5